app/controllers/students_controller.rb

  def index

    #Controller
    @students = Student.where(:career => 'Medicina').paginate(:page => params[:page], per_page: 10).order('PAPA DESC')
---
SELECT  "students".* FROM "students" WHERE "students"."career" = ? ORDER BY PAPA DESC LIMIT ? OFFSET ?  [["career", "Medicina"], ["LIMIT", 10], ["OFFSET", 0]]

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "lastname", "email", "age", "career", "PAPA", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_student
      @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]